artillery/create.yml
config:
  target: 'http://localhost:3000'
  payload:
    path: "channels.csv"
    skipHeader: true
    fields:
      - "name"
      - "description"
      - "user"
      - "isProfile"
  phases:
    - duration: 180
      arrivalRate: 10
      rampTo: 100
      name: "Warm up phase"
    - duration: 600
      arrivalRate: 100
      name: "Sustained max load phase"
  ensure:
    p99: 10
scenarios:
  - flow:
    - post:
        url: "/api/channel"
        json:
          name: "{{ name }}"
          description: "{{ description }}"
        headers:
          authorization: "bearer eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpZCI6InVzZXJAZG8ifQ.k1sGqvw0IJ1ocB9XrF8Oviaz4D-A4E9fDkz_VmAY-LA"