artillery/search.yml
config:
  target: 'http://localhost:3000'
  payload:
    path: "search.csv"
    skipHeader: true
    fields:
      - "searchFilter"
  phases:
    - duration: 180
      arrivalRate: 10
      rampTo: 50
      name: "Warm up phase"
    - pause: 10
      name: "Pause phase"
    - duration: 300
      arrivalRate: 50
      name: "Sustained max load phase"
  ensure:
    p99: 10
scenarios:
  - flow:
    - get:
        url: "/api/channel/search?searchFilter={{ searchFilter }}"
        headers:
          authorization: "bearer eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpZCI6InVzZXJAZG8ifQ.k1sGqvw0IJ1ocB9XrF8Oviaz4D-A4E9fDkz_VmAY-LA"